alicemirror/psoc4200_2stepper_controller/codegentemp/DualStepperController-PSoC4200-GearBest.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>TCPWM_1</name>
      <description>No description available</description>
      <baseAddress>0x0</baseAddress>
      <addressBlock>
        <offset>0</offset>
        <size>0x0</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <register>
          <name>COUNTER</name>
          <description>Current counter value</description>
          <addressOffset>0x400501C8</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0</resetMask>
        </register>
        <register>
          <name>CC</name>
          <description>Compare / capture value</description>
          <addressOffset>0x400501CC</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0</resetMask>
        </register>
        <register>
          <name>CC_BUF</name>
          <description>Compare / capture buffer value</description>
          <addressOffset>0x400501D0</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0</resetMask>
        </register>
        <register>
          <name>PERIOD</name>
          <description>Period value</description>
          <addressOffset>0x400501D4</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0</resetMask>
        </register>
        <register>
          <name>PERIOD_BUF</name>
          <description>Period buffer value</description>
          <addressOffset>0x400501D8</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0</resetMask>
        </register>
      </registers>
    </peripheral>
    <peripheral>
      <name>TCPWM_4</name>
      <description>No description available</description>
      <baseAddress>0x0</baseAddress>
      <addressBlock>
        <offset>0</offset>
        <size>0x0</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <register>
          <name>COUNTER</name>
          <description>Current counter value</description>
          <addressOffset>0x40050148</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0</resetMask>
        </register>
        <register>
          <name>CC</name>
          <description>Compare / capture value</description>
          <addressOffset>0x4005014C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0</resetMask>
        </register>
        <register>
          <name>CC_BUF</name>
          <description>Compare / capture buffer value</description>
          <addressOffset>0x40050150</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0</resetMask>
        </register>
        <register>
          <name>PERIOD</name>
          <description>Period value</description>
          <addressOffset>0x40050154</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0</resetMask>
        </register>
        <register>
          <name>PERIOD_BUF</name>
          <description>Period buffer value</description>
          <addressOffset>0x40050158</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0</resetMask>
        </register>
      </registers>
    </peripheral>
    <peripheral>
      <name>TCPWM_3</name>
      <description>No description available</description>
      <baseAddress>0x0</baseAddress>
      <addressBlock>
        <offset>0</offset>
        <size>0x0</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <register>
          <name>COUNTER</name>
          <description>Current counter value</description>
          <addressOffset>0x40050108</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0</resetMask>
        </register>
        <register>
          <name>CC</name>
          <description>Compare / capture value</description>
          <addressOffset>0x4005010C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0</resetMask>
        </register>
        <register>
          <name>CC_BUF</name>
          <description>Compare / capture buffer value</description>
          <addressOffset>0x40050110</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0</resetMask>
        </register>
        <register>
          <name>PERIOD</name>
          <description>Period value</description>
          <addressOffset>0x40050114</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0</resetMask>
        </register>
        <register>
          <name>PERIOD_BUF</name>
          <description>Period buffer value</description>
          <addressOffset>0x40050118</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0</resetMask>
        </register>
      </registers>
    </peripheral>
    <peripheral>
      <name>INTERNAL_STEP_2</name>
      <description>No description available</description>
      <baseAddress>0x0</baseAddress>
      <addressBlock>
        <offset>0</offset>
        <size>0x0</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <register>
          <name>INTERNAL_STEP_2_COMPARE_Reg</name>
          <description>UDB.D0 - Assigned Compare Value</description>
          <addressOffset>0x400F0020</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0</resetMask>
        </register>
        <register>
          <name>INTERNAL_STEP_2_Control_Reg</name>
          <description>UDB Control Register - Assigned Control Register Value</description>
          <addressOffset>0x400F0071</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0</resetMask>
          <fields>
            <field>
              <name>CTRL_ENABLE</name>
              <description>Enable the PWM</description>
              <lsb>7</lsb>
              <msb>7</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>CTRL_CMPMODE2</name>
              <description>Compare mode 2</description>
              <lsb>3</lsb>
              <msb>5</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>CTRL_CMPMODE1</name>
              <description>Compare mode 1</description>
              <lsb>0</lsb>
              <msb>2</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>INTERNAL_STEP_2_STATUS_AUX_CTRLDP0</name>
          <description>UDB Auxilliary Control Register</description>
          <addressOffset>0x400F0090</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0</resetMask>
          <fields>
            <field>
              <name>FIFO0_CLR</name>
              <description>FIFO0 clear</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>E_FIFO_CLR_0</name>
                  <description>Normal FIFO operation</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>E_FIFO_CLR_1</name>
                  <description>Clear FIFO state</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>FIFO1_CLR</name>
              <description>FIFO1 clear</description>
              <lsb>1</lsb>
              <msb>1</msb>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>E_FIFO_CLR_0</name>
                  <description>Normal FIFO operation</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>E_FIFO_CLR_1</name>
                  <description>Clear FIFO state</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>FIFO0_LVL</name>
              <description>FIFO level</description>
              <lsb>2</lsb>
              <msb>2</msb>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>E_FIFO_LVL_0</name>
                  <description>FIFO LVL: input mode: FIFO not full; output mode: FIFO not empty</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>E_FIFO_LVL_1</name>
                  <description>FIFO LVL: input mode: FIFO at least 1/2 empty; output mode: FIFO at least 1/2 full</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>FIFO1_LVL</name>
              <description>FIFO level</description>
              <lsb>3</lsb>
              <msb>3</msb>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>E_FIFO_LVL_0</name>
                  <description>FIFO LVL: input mode: FIFO not full; output mode: FIFO not empty</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>E_FIFO_LVL_1</name>
                  <description>FIFO LVL: input mode: FIFO at least 1/2 empty; output mode: FIFO at least 1/2 full</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>INT_EN</name>
              <description>No description available</description>
              <lsb>4</lsb>
              <msb>4</msb>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>E_INT_EN0</name>
                  <description>Interrupt disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>E_INT_EN1</name>
                  <description>Interrupt enabled</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CNT_START</name>
              <description>FIFO0 clear</description>
              <lsb>5</lsb>
              <msb>5</msb>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>E_CNT_START0</name>
                  <description>Disable counter</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>E_CNT_START1</name>
                  <description>Enable counter</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>INTERNAL_STEP_2_STATUS_AUX_CTRLDP1</name>
          <description>UDB Auxilliary Control Register</description>
          <addressOffset>0x400F0091</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0</resetMask>
          <fields>
            <field>
              <name>FIFO0_CLR</name>
              <description>FIFO0 clear</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>E_FIFO_CLR_0</name>
                  <description>Normal FIFO operation</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>E_FIFO_CLR_1</name>
                  <description>Clear FIFO state</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>FIFO1_CLR</name>
              <description>FIFO1 clear</description>
              <lsb>1</lsb>
              <msb>1</msb>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>E_FIFO_CLR_0</name>
                  <description>Normal FIFO operation</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>E_FIFO_CLR_1</name>
                  <description>Clear FIFO state</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>FIFO0_LVL</name>
              <description>FIFO level</description>
              <lsb>2</lsb>
              <msb>2</msb>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>E_FIFO_LVL_0</name>
                  <description>FIFO LVL: input mode: FIFO not full; output mode: FIFO not empty</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>E_FIFO_LVL_1</name>
                  <description>FIFO LVL: input mode: FIFO at least 1/2 empty; output mode: FIFO at least 1/2 full</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>FIFO1_LVL</name>
              <description>FIFO level</description>
              <lsb>3</lsb>
              <msb>3</msb>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>E_FIFO_LVL_0</name>
                  <description>FIFO LVL: input mode: FIFO not full; output mode: FIFO not empty</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>E_FIFO_LVL_1</name>
                  <description>FIFO LVL: input mode: FIFO at least 1/2 empty; output mode: FIFO at least 1/2 full</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>INT_EN</name>
              <description>No description available</description>
              <lsb>4</lsb>
              <msb>4</msb>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>E_INT_EN0</name>
                  <description>Interrupt disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>E_INT_EN1</name>
                  <description>Interrupt enabled</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CNT_START</name>
              <description>FIFO0 clear</description>
              <lsb>5</lsb>
              <msb>5</msb>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>E_CNT_START0</name>
                  <description>Disable counter</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>E_CNT_START1</name>
                  <description>Enable counter</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
      </registers>
    </peripheral>
  </peripherals>
</device>